app/Models/NovelModel.php

SELECT `novel`.*, `genre`.`nama_genre`
FROM `novel`
JOIN `genre` ON `genre`.`id_genre` = `novel`.`id_genre`
---
    public function getAllDataJoin(){
        $query = $this -> db -> table("novel")
        -> select ("novel.*, genre.nama_genre")
        ->join ("genre", "genre.id_genre = novel.id_genre");
        return $query->get()->getResultArray();