app/Models/UserModel.php

	public function login($username, $password)
{
    // Mengubah penggunaan objek koneksi menjadi objek query builder
    $query = $this->db->table('users')
                     ->where('username', $username)
                     ->where('password', $password)
                     ->get();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
AND `password` = 'admin123'